---
title: "导入&导出数据"
format:
  html:
   code-fold: true
   code-tools: true
jupyter: python3
---

![](./img/rw.png)

### 读取本地数据
获取数据```data.csv```[下载地址](https://www.w3schools.com/python/pandas/data.csv)，将csv文件下载到本地。

In [1]:
# 导入pandas包
import pandas as pd

# 注意csv文件路径
df = pd.read_csv('./example_data/data.csv') 

# 打印前五个
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

### 读取线上数据
线上[数据地址](https://www.w3schools.com/python/pandas/data.csv.txt)

In [2]:
df = pd.read_csv('https://www.w3schools.com/python/pandas/data.csv.txt')

# 打印前五个
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

## 选取特定数据 {.unnumbered}

在数据分析中，选取需要的数据进行处理和分析是很重要的。在Excel中，主要通过鼠标点选或拖拽来选取数据。

而在pandas中，我们也可以通过行列名、索引以及各种条件来筛选感兴趣的数据子集，并进行数据过滤、筛选、切片、分析和连接等操作。

In [3]:
# 获取案例数据
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/main/doc/data/titanic.csv') 
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

::: {.callout-note}
本教程使用存储为 CSV 格式的泰坦尼克号数据集。以下是详细说明（改成折叠！！！！！）

PassengerId：每位乘客的Id。

Survived：指示乘客是否幸存。0是和1否。

Pclass：3 个机票类别之一：Class 1、Class2和 Class 3。

Name：乘客姓名。

Sex：乘客的性别。

Age：乘客的年龄。

SibSp：船上兄弟姐妹或配偶的数量。

Parch：船上父母或孩子的人数。

Ticket：旅客的客票号。

Fare：表示票价。

Cabin：乘客的客舱号。

Embarked：登船的港口。
:::

### 选取特定列

通过列索引标签或以属性的方式可以单独获取 DataFrame的列数据，返回的数据为 Series结构。

假如我想知道每位乘客的姓名id（选取单列），```df```为数据表格，```Name```为列名

In [4]:
# 方法一：
df['Name']

# 方法二：
df.Name

# 方法三：
df.loc[:, 'Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

假如我想知道所有乘客的幸存情况（获取多列），我们可以通过两个中括号，可以获取多个列的数据。

In [ ]:
df[['Name','Survived']].head()

::: {.callout-tip}
内部方括号定义了一个 带有列名的[Python列表](https://docs.python.org/3/tutorial/datastructures.html#tut-morelists)，而外部方括号用于从 pandas 中选择数据
:::

### 选取特定行
通过行索引获取行数据，冒号指定范围

假设想知道第三行，Laina小姐的信息（单行）

In [5]:
# 选取从第二行到第三行到数据
df[2:3]

# df[2:5] 选取从第三行到第五行到数据

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

如果我不想按顺序这样选取多行数据呢？

如果想获取单独的几行，通过loc和iloc方法 来获取第二行Laina和第五行William的信息

::: {.callout-warning}
注意在pandas中第0行才是第一行，所以切片要-1
:::

iloc方法是按行索引位置选取数据，索引就是表格最左边的数字

In [8]:
df.iloc[[2,4]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

loc方法是按行索引标签选取数据，因为这里索引的标签和位置相同，所以结果同上

In [ ]:
df.loc[[2,4]]

## 根据条件筛选行列

假设我想知道十八岁以下的乘客信息

In [10]:
df[df["Age"] < 18].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q

::: {.callout-note}
从里到外来拆解，首先需要先确定```"Age"```列，然后使用运算符```>```，选取十八岁以下的乘客。然后把这两操作在用方括号框起来，表明在数据```df```中操作，```.head()```选取前五行。
:::

DataFrames 可以通过多种方式进行过滤，其中最直观的是使用[布尔索引](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-boolean)